Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase.ReloadWindow Method
 Reloads the dialog values.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ReloadWindow()
Public Sub ReloadWindow
See Also
Reference
PluginWindowBase Class
Tekla.Structures.Dialog Namespace